## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_monitor_data_collection_endpoint.aks_dce will be updated in-place
  ~ resource "azurerm_monitor_data_collection_endpoint" "aks_dce" {
        id                            = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/prvaks-monitoring-rg/providers/Microsoft.Insights/dataCollectionEndpoints/prvaks-dce"
        name                          = "prvaks-dce"
      ~ tags                          = {
          - "Environment" = "Dev" -> null
          - "Owner"       = "kmiszel" -> null
          - "Source"      = "Terraform" -> null
        }
        # (8 unchanged attributes hidden)
    }

  # azurerm_role_assignment.aks_readerrole will be created
  + resource "azurerm_role_assignment" "aks_readerrole" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4eb4abe4-cfe9-4343-92ee-e9a2f212eb70"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/providers/Microsoft.Authorization/roleDefinitions/b0d8363b-8ddd-447d-831f-62ca05bff136"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/prvaks-monitoring-rg/providers/Microsoft.Monitor/accounts/prvaks-amw"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.eid_role_assignment-grafanaviewers.azurerm_role_assignment.eid_group_assignment["5834d83c-4d84-4438-8f5d-581fc9f12fa9"] will be created
  + resource "azurerm_role_assignment" "eid_group_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5834d83c-4d84-4438-8f5d-581fc9f12fa9"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Viewer"
      + scope                            = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/prvaks-monitoring-rg/providers/Microsoft.Dashboard/grafana/prvaks-grafana"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>